---
kind: type
id: T:Autodesk.Revit.DB.Structure.PathReinforcementType
source: html/3bddfeb2-4db2-1bf1-b7e8-09238c8dfb32.htm
---
# Autodesk.Revit.DB.Structure.PathReinforcementType

An object that specifies the type of a Structural Path Reinforcement element in Autodesk Revit.

## Syntax (C#)
```csharp
public class PathReinforcementType : ElementType
```

## Remarks
The clear cover settings can be accessed via this object.